# AllElementsRemovedFromGroup Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..AllElementsRemovedFromGroup Property
BuiltInFailures..::..GroupFailures Class See Also
---
Group "[Type Name]" is now empty and will be deleted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AllElementsRemovedFromGroup { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AllElementsRemovedFromGroup As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AllElementsRemovedFromGroup {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace